xdu-aero-association/FM33LC0XX_Example_0.04/CRC 示例/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_gpio.h
/**
  *******************************************************************************************************
  * @file    fm33lc0xx_ll_gpio.h
  * @author  FMSH Application Team
  * @brief   Head file of GPIO LL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2019] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under the Mulan PSL v1.
  * can use this software according to the terms and conditions of the Mulan PSL v1.
  * You may obtain a copy of Mulan PSL v1 at:
  * http://license.coscl.org.cn/MulanPSL
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR
  * IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT, MERCHANTABILITY OR FIT FOR A PARTICULAR
  * PURPOSE.
  * See the Mulan PSL v1 for more details.
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33LC0XX_LL_GPIO_H
#define __FM33LC0XX_LL_GPIO_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33xx.h"
/** @addtogroup FM33LC0XX_LL_Driver_GPIO
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup GPIO_LL_ES_INIT GPIO Exported Init structures
  * @{
  */

/**
  * @brief LL GPIO Init Sturcture definition
  */
typedef struct
{
    /*! PIN */
    uint32_t Pin;          
    /*! 功能模式 */
    uint32_t Mode;
    /*! 输出类型 */      
    uint32_t OutputType;
    /*! 上拉使能 */                                           
    uint32_t Pull;
    /*! 数字功能重定向 */
    uint32_t RemapPin;  
                                                      
} LL_GPIO_InitTypeDef;
/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup GPIO_LL_Exported_Constants GPIO Exported Constants
  * @{
  */
#define    LL_GPIO_PIN_0                                          (0x1U << 0U)
#define    LL_GPIO_PIN_1                                          (0x1U << 1U)
#define    LL_GPIO_PIN_2                                          (0x1U << 2U)
#define    LL_GPIO_PIN_3                                          (0x1U << 3U)
#define    LL_GPIO_PIN_4                                          (0x1U << 4U)
#define    LL_GPIO_PIN_5                                          (0x1U << 5U)
#define    LL_GPIO_PIN_6                                          (0x1U << 6U)
#define    LL_GPIO_PIN_7                                          (0x1U << 7U)
#define    LL_GPIO_PIN_8                                          (0x1U << 8U)
#define    LL_GPIO_PIN_9                                          (0x1U << 9U)
#define    LL_GPIO_PIN_10                                         (0x1U << 10U)
#define    LL_GPIO_PIN_11                                         (0x1U << 11U)
#define    LL_GPIO_PIN_12                                         (0x1U << 12U)
#define    LL_GPIO_PIN_13                                         (0x1U << 13U)
#define    LL_GPIO_PIN_14                                         (0x1U << 14U)
#define    LL_GPIO_PIN_15                                         (0x1U << 15U)
#define    LL_GPIO_PIN_ALL                                        (0xFFFFU << 0U)
#define    LL_GPIO_PIN_ALL_EXCEPTSWD                              (0xFE7FU << 0U)
#define    LL_GPIO_EXTI_LINE_0                                    (0x1U << 0U)
#define    LL_GPIO_EXTI_LINE_1                                    (0x1U << 1U)
#define    LL_GPIO_EXTI_LINE_2                                    (0x1U << 2U)
#define    LL_GPIO_EXTI_LINE_3                                    (0x1U << 3U)
#define    LL_GPIO_EXTI_LINE_4                                    (0x1U << 4U)
#define    LL_GPIO_EXTI_LINE_5                                    (0x1U << 5U)
#define    LL_GPIO_EXTI_LINE_6                                    (0x1U << 6U)
#define    LL_GPIO_EXTI_LINE_7                                    (0x1U << 7U)
#define    LL_GPIO_EXTI_LINE_8                                    (0x1U << 8U)
#define    LL_GPIO_EXTI_LINE_9                                    (0x1U << 9U)
#define    LL_GPIO_EXTI_LINE_10                                   (0x1U << 10U)
#define    LL_GPIO_EXTI_LINE_11                                   (0x1U << 11U)
#define    LL_GPIO_EXTI_LINE_12                                   (0x1U << 12U)
#define    LL_GPIO_EXTI_LINE_13                                   (0x1U << 13U)
#define    LL_GPIO_EXTI_LINE_14                                   (0x1U << 14U)
#define    LL_GPIO_EXTI_LINE_15                                   (0x1U << 15U)
#define    LL_GPIO_EXTI_LINE_ALL                                  (0xFFFFU << 0U)

#define    LL_GPIO_EXTI_LINE_0_PA0                                (0x0U << 0U)
#define    LL_GPIO_EXTI_LINE_0_PA1                                (0x1U << 0U)
#define    LL_GPIO_EXTI_LINE_0_PA2                                (0x2U << 0U)
#define    LL_GPIO_EXTI_LINE_0_PA3                                (0x3U << 0U)
#define    LL_GPIO_EXTI_LINE_1_PA4                                (0x0U << 2U)
#define    LL_GPIO_EXTI_LINE_1_PA5                                (0x1U << 2U)
#define    LL_GPIO_EXTI_LINE_1_PA6                                (0x2U << 2U)
#define    LL_GPIO_EXTI_LINE_1_PA7                                (0x3U << 2U)
#define    LL_GPIO_EXTI_LINE_2_PA8                                (0x0U << 4U)
#define    LL_GPIO_EXTI_LINE_2_PA9                                (0x1U << 4U)
#define    LL_GPIO_EXTI_LINE_2_PA10                               (0x2U << 4U)
#define    LL_GPIO_EXTI_LINE_2_PA11                               (0x3U << 4U)
#define    LL_GPIO_EXTI_LINE_3_PA12                               (0x0U << 6U)
#define    LL_GPIO_EXTI_LINE_3_PA13                               (0x1U << 6U)
#define    LL_GPIO_EXTI_LINE_3_PA14                               (0x2U << 6U)
#define    LL_GPIO_EXTI_LINE_3_PA15                               (0x3U << 6U)
#define    LL_GPIO_EXTI_LINE_4_PB0                                (0x0U << 8U)
#define    LL_GPIO_EXTI_LINE_4_PB1                                (0x1U << 8U)
#define    LL_GPIO_EXTI_LINE_4_PB2                                (0x2U << 8U)
#define    LL_GPIO_EXTI_LINE_4_PB3                                (0x3U << 8U)
#define    LL_GPIO_EXTI_LINE_5_PB4                                (0x0U << 10U)
#define    LL_GPIO_EXTI_LINE_5_PB5                                (0x1U << 10U)
#define    LL_GPIO_EXTI_LINE_5_PB6                                (0x2U << 10U)
#define    LL_GPIO_EXTI_LINE_5_PB7                                (0x3U << 10U)
#define    LL_GPIO_EXTI_LINE_6_PB8                                (0x0U << 12U)
#define    LL_GPIO_EXTI_LINE_6_PB9                                (0x1U << 12U)
#define    LL_GPIO_EXTI_LINE_6_PB10                               (0x2U << 12U)
#define    LL_GPIO_EXTI_LINE_6_PB11                               (0x3U << 12U)
#define    LL_GPIO_EXTI_LINE_7_PB12                               (0x0U << 14U)
#define    LL_GPIO_EXTI_LINE_7_PB13                               (0x1U << 14U)
#define    LL_GPIO_EXTI_LINE_7_PB14                               (0x2U << 14U)
#define    LL_GPIO_EXTI_LINE_7_PB15                               (0x3U << 14U)
#define    LL_GPIO_EXTI_LINE_8_PC0                                (0x0U << 16U)
#define    LL_GPIO_EXTI_LINE_8_PC1                                (0x1U << 16U)
#define    LL_GPIO_EXTI_LINE_8_PC2                                (0x2U << 16U)
#define    LL_GPIO_EXTI_LINE_8_PC3                                (0x3U << 16U)
#define    LL_GPIO_EXTI_LINE_9_PC4                                (0x0U << 18U)
#define    LL_GPIO_EXTI_LINE_9_PC5                                (0x1U << 18U)
#define    LL_GPIO_EXTI_LINE_9_PC6                                (0x2U << 18U)
#define    LL_GPIO_EXTI_LINE_9_PC7                                (0x3U << 18U)
#define    LL_GPIO_EXTI_LINE_10_PC8                               (0x0U << 20U)
#define    LL_GPIO_EXTI_LINE_10_PC9                               (0x1U << 20U)
#define    LL_GPIO_EXTI_LINE_10_PC10                              (0x2U << 20U)
#define    LL_GPIO_EXTI_LINE_10_PC11                              (0x3U << 20U)
#define    LL_GPIO_EXTI_LINE_12_PD0                               (0x0U << 24U)
#define    LL_GPIO_EXTI_LINE_12_PD1                               (0x1U << 24U)
#define    LL_GPIO_EXTI_LINE_12_PD2                               (0x2U << 24U)
#define    LL_GPIO_EXTI_LINE_12_PD3                               (0x3U << 24U)
#define    LL_GPIO_EXTI_LINE_13_PD4                               (0x0U << 26U)
#define    LL_GPIO_EXTI_LINE_13_PD5                               (0x1U << 26U)
#define    LL_GPIO_EXTI_LINE_13_PD6                               (0x2U << 26U)
#define    LL_GPIO_EXTI_LINE_13_PD7                               (0x3U << 26U)
#define    LL_GPIO_EXTI_LINE_14_PD8                               (0x0U << 28U)
#define    LL_GPIO_EXTI_LINE_14_PD9                               (0x1U << 28U)
#define    LL_GPIO_EXTI_LINE_14_PD10                              (0x2U << 28U)
#define    LL_GPIO_EXTI_LINE_14_PD11                              (0x3U << 28U)
#define    LL_GPIO_WKUP_0                                         (0x1U << 0U)
#define    LL_GPIO_WKUP_1                                         (0x1U << 1U)
#define    LL_GPIO_WKUP_2                                         (0x1U << 2U)
#define    LL_GPIO_WKUP_3                                         (0x1U << 3U)
#define    LL_GPIO_WKUP_4                                         (0x1U << 4U)
#define    LL_GPIO_WKUP_5                                         (0x1U << 5U)
#define    LL_GPIO_WKUP_6                                         (0x1U << 6U)
#define    LL_GPIO_WKUP_7                                         (0x1U << 7U)



#define    LL_GPIO_MODE_INPUT                                     (0x0U << GPIO_FCR_Pos)
#define    LL_GPIO_MODE_OUTPUT                                    (0x1U << GPIO_FCR_Pos)
#define    LL_GPIO_MODE_DIGITAL                                   (0x2U << GPIO_FCR_Pos)
#define    LL_GPIO_MODE_ANALOG                                    (0x3U << GPIO_FCR_Pos)

