xdu-aero-association/FM33LC0XX_Example_0.04/CRC 示例/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_gpio.h
#define    LL_GPIO_EXTI_TRIGGER_RISING                            (0x0U << GPIO_EXTIEDS_Pos)
#define    LL_GPIO_EXTI_TRIGGER_FALLING                           (0x1U << GPIO_EXTIEDS_Pos)
#define    LL_GPIO_EXTI_TRIGGER_BOTHEDGE                          (0x2U << GPIO_EXTIEDS_Pos)
#define    LL_GPIO_EXTI_TRIGGER_NONE                              (0x3U << GPIO_EXTIEDS_Pos)

#define    LL_GPIO_FOUT1_SELECT_XTLF                              (0x0U << GPIO_FOUTSEL_FOUT1_Pos)
#define    LL_GPIO_FOUT1_SELECT_RCLP                              (0x1U << GPIO_FOUTSEL_FOUT1_Pos)
#define    LL_GPIO_FOUT1_SELECT_RCHF_DIV64                        (0x2U << GPIO_FOUTSEL_FOUT1_Pos)
#define    LL_GPIO_FOUT1_SELECT_LSCLK                             (0x3U << GPIO_FOUTSEL_FOUT1_Pos)
#define    LL_GPIO_FOUT1_SELECT_AHBCLK_DIV64                      (0x4U << GPIO_FOUTSEL_FOUT1_Pos)
#define    LL_GPIO_FOUT1_SELECT_RTCTM                             (0x5U << GPIO_FOUTSEL_FOUT1_Pos)
#define    LL_GPIO_FOUT1_SELECT_PLLOUTPUT_DIV64                   (0x6U << GPIO_FOUTSEL_FOUT1_Pos)
#define    LL_GPIO_FOUT1_SELECT_RTCCLK64HZ                        (0x7U << GPIO_FOUTSEL_FOUT1_Pos)
#define    LL_GPIO_FOUT1_SELECT_APBCLK_DIV64                      (0x8U << GPIO_FOUTSEL_FOUT1_Pos)
#define    LL_GPIO_FOUT1_SELECT_PLLOUTPUT                         (0x9U << GPIO_FOUTSEL_FOUT1_Pos)
#define    LL_GPIO_FOUT1_SELECT_RC4M_PSC                          (0xAU << GPIO_FOUTSEL_FOUT1_Pos)
#define    LL_GPIO_FOUT1_SELECT_RCHF                              (0xBU << GPIO_FOUTSEL_FOUT1_Pos)
#define    LL_GPIO_FOUT1_SELECT_XTHF_DIV64                        (0xCU << GPIO_FOUTSEL_FOUT1_Pos)
#define    LL_GPIO_FOUT1_SELECT_ADCCLK_DIV64                      (0xDU << GPIO_FOUTSEL_FOUT1_Pos)
#define    LL_GPIO_FOUT1_SELECT_CLK_8K                            (0xEU << GPIO_FOUTSEL_FOUT1_Pos)
#define    LL_GPIO_FOUT1_SELECT_COMP2_OUTPUT                      (0xFU << GPIO_FOUTSEL_FOUT1_Pos)

#define    LL_GPIO_FOUT0_SELECT_XTLF                              (0x0U << GPIO_FOUTSEL_FOUT0_Pos)
#define    LL_GPIO_FOUT0_SELECT_RCLP                              (0x1U << GPIO_FOUTSEL_FOUT0_Pos)
#define    LL_GPIO_FOUT0_SELECT_RCHF_DIV64                        (0x2U << GPIO_FOUTSEL_FOUT0_Pos)
#define    LL_GPIO_FOUT0_SELECT_LSCLK                             (0x3U << GPIO_FOUTSEL_FOUT0_Pos)
#define    LL_GPIO_FOUT0_SELECT_AHBCLK_DIV64                      (0x4U << GPIO_FOUTSEL_FOUT0_Pos)
#define    LL_GPIO_FOUT0_SELECT_RTCTM                             (0x5U << GPIO_FOUTSEL_FOUT0_Pos)
#define    LL_GPIO_FOUT0_SELECT_PLLOUTPUT_DIV64                   (0x6U << GPIO_FOUTSEL_FOUT0_Pos)
#define    LL_GPIO_FOUT0_SELECT_RTCCLK64HZ                        (0x7U << GPIO_FOUTSEL_FOUT0_Pos)
#define    LL_GPIO_FOUT0_SELECT_APBCLK_DIV64                      (0x8U << GPIO_FOUTSEL_FOUT0_Pos)
#define    LL_GPIO_FOUT0_SELECT_PLLOUTPUT                         (0x9U << GPIO_FOUTSEL_FOUT0_Pos)
#define    LL_GPIO_FOUT0_SELECT_RC4M_PSC                          (0xAU << GPIO_FOUTSEL_FOUT0_Pos)
#define    LL_GPIO_FOUT0_SELECT_RCHF                              (0xBU << GPIO_FOUTSEL_FOUT0_Pos)
#define    LL_GPIO_FOUT0_SELECT_XTHF_DIV64                        (0xCU << GPIO_FOUTSEL_FOUT0_Pos)
#define    LL_GPIO_FOUT0_SELECT_COMP1_OUTPUT                      (0xDU << GPIO_FOUTSEL_FOUT0_Pos)
#define    LL_GPIO_FOUT0_SELECT_CLK_8K                            (0xEU << GPIO_FOUTSEL_FOUT0_Pos)
#define    LL_GPIO_FOUT0_SELECT_ADC_CLK                           (0xFU << GPIO_FOUTSEL_FOUT0_Pos)

#define    LL_GPIO_OUTPUT_PUSHPULL                                (0)
#define    LL_GPIO_OUTPUT_OPENDRAIN                               (1)
#define    LL_GPIO_WKUP_POLARITY_RISING                           (0x1U << 8)
#define    LL_GPIO_WKUP_POLARITY_FALLING                          (0x0U << 8)
/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup GPIO_LL_Exported_Functions GPIO Exported Functions
  * @{
  */

/**
  * @brief    
  * @rmtoll   INEN        LL_GPIO_EnablePinInput
  * @param    GPIOx GPIO Port
  * @param    Pin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_PIN_0
  *           @arg @ref LL_GPIO_PIN_1
  *           @arg @ref LL_GPIO_PIN_2
  *           @arg @ref LL_GPIO_PIN_3
  *           @arg @ref LL_GPIO_PIN_4
  *           @arg @ref LL_GPIO_PIN_5
  *           @arg @ref LL_GPIO_PIN_6
  *           @arg @ref LL_GPIO_PIN_7
  *           @arg @ref LL_GPIO_PIN_8
  *           @arg @ref LL_GPIO_PIN_9
  *           @arg @ref LL_GPIO_PIN_10
  *           @arg @ref LL_GPIO_PIN_11
  *           @arg @ref LL_GPIO_PIN_12
  *           @arg @ref LL_GPIO_PIN_13
  *           @arg @ref LL_GPIO_PIN_14
  *           @arg @ref LL_GPIO_PIN_15
  *           @arg @ref LL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_EnablePinInput(GPIO_Type *GPIOx, uint32_t Pin)
{
    SET_BIT(GPIOx->INEN, ((Pin & 0xFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   INEN        LL_GPIO_DisablePinInput
  * @param    GPIOx GPIO Port
  * @param    Pin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_PIN_0
  *           @arg @ref LL_GPIO_PIN_1
  *           @arg @ref LL_GPIO_PIN_2
  *           @arg @ref LL_GPIO_PIN_3
  *           @arg @ref LL_GPIO_PIN_4
  *           @arg @ref LL_GPIO_PIN_5
  *           @arg @ref LL_GPIO_PIN_6
  *           @arg @ref LL_GPIO_PIN_7
  *           @arg @ref LL_GPIO_PIN_8
  *           @arg @ref LL_GPIO_PIN_9
  *           @arg @ref LL_GPIO_PIN_10
  *           @arg @ref LL_GPIO_PIN_11
  *           @arg @ref LL_GPIO_PIN_12
  *           @arg @ref LL_GPIO_PIN_13
  *           @arg @ref LL_GPIO_PIN_14
  *           @arg @ref LL_GPIO_PIN_15
  *           @arg @ref LL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_DisablePinInput(GPIO_Type *GPIOx, uint32_t Pin)
{
    CLEAR_BIT(GPIOx->INEN, ((Pin & 0xFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   INEN        LL_GPIO_IsEnabledPinInput
  * @param    GPIOx GPIO Port
  * @param    Pin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_PIN_0
  *           @arg @ref LL_GPIO_PIN_1
  *           @arg @ref LL_GPIO_PIN_2
  *           @arg @ref LL_GPIO_PIN_3
  *           @arg @ref LL_GPIO_PIN_4
  *           @arg @ref LL_GPIO_PIN_5
  *           @arg @ref LL_GPIO_PIN_6
  *           @arg @ref LL_GPIO_PIN_7
  *           @arg @ref LL_GPIO_PIN_8
  *           @arg @ref LL_GPIO_PIN_9
  *           @arg @ref LL_GPIO_PIN_10
  *           @arg @ref LL_GPIO_PIN_11
  *           @arg @ref LL_GPIO_PIN_12
  *           @arg @ref LL_GPIO_PIN_13
  *           @arg @ref LL_GPIO_PIN_14
  *           @arg @ref LL_GPIO_PIN_15
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPIO_IsEnabledPinInput(GPIO_Type *GPIOx, uint32_t Pin)
{
    return (uint32_t)(READ_BIT(GPIOx->INEN, ((Pin & 0xFFFF) << 0x0U)) == ((Pin & 0xFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   PUEN        LL_GPIO_EnablePinPullup
  * @param    GPIOx GPIO Port
  * @param    Pin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_PIN_0
  *           @arg @ref LL_GPIO_PIN_1
  *           @arg @ref LL_GPIO_PIN_2
  *           @arg @ref LL_GPIO_PIN_3
  *           @arg @ref LL_GPIO_PIN_4
  *           @arg @ref LL_GPIO_PIN_5
  *           @arg @ref LL_GPIO_PIN_6
  *           @arg @ref LL_GPIO_PIN_7
  *           @arg @ref LL_GPIO_PIN_8
  *           @arg @ref LL_GPIO_PIN_9
  *           @arg @ref LL_GPIO_PIN_10
  *           @arg @ref LL_GPIO_PIN_11
  *           @arg @ref LL_GPIO_PIN_12
  *           @arg @ref LL_GPIO_PIN_13
  *           @arg @ref LL_GPIO_PIN_14
  *           @arg @ref LL_GPIO_PIN_15
  *           @arg @ref LL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_EnablePinPullup(GPIO_Type *GPIOx, uint32_t Pin)
{
    SET_BIT(GPIOx->PUEN, ((Pin & 0xFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   PUEN        LL_GPIO_DisablePinPullup
  * @param    GPIOx GPIO Port
  * @param    Pin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_PIN_0
  *           @arg @ref LL_GPIO_PIN_1
  *           @arg @ref LL_GPIO_PIN_2
  *           @arg @ref LL_GPIO_PIN_3
  *           @arg @ref LL_GPIO_PIN_4
  *           @arg @ref LL_GPIO_PIN_5
  *           @arg @ref LL_GPIO_PIN_6
  *           @arg @ref LL_GPIO_PIN_7
  *           @arg @ref LL_GPIO_PIN_8
  *           @arg @ref LL_GPIO_PIN_9
  *           @arg @ref LL_GPIO_PIN_10
  *           @arg @ref LL_GPIO_PIN_11
  *           @arg @ref LL_GPIO_PIN_12
  *           @arg @ref LL_GPIO_PIN_13
  *           @arg @ref LL_GPIO_PIN_14
  *           @arg @ref LL_GPIO_PIN_15
  *           @arg @ref LL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_DisablePinPullup(GPIO_Type *GPIOx, uint32_t Pin)
{
    CLEAR_BIT(GPIOx->PUEN, ((Pin & 0xFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   PUEN        LL_GPIO_IsEnabledPinPullup
  * @param    GPIOx GPIO Port
  * @param    Pin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_PIN_0
  *           @arg @ref LL_GPIO_PIN_1
  *           @arg @ref LL_GPIO_PIN_2
  *           @arg @ref LL_GPIO_PIN_3
  *           @arg @ref LL_GPIO_PIN_4
  *           @arg @ref LL_GPIO_PIN_5
  *           @arg @ref LL_GPIO_PIN_6
  *           @arg @ref LL_GPIO_PIN_7
  *           @arg @ref LL_GPIO_PIN_8
  *           @arg @ref LL_GPIO_PIN_9
  *           @arg @ref LL_GPIO_PIN_10
  *           @arg @ref LL_GPIO_PIN_11
  *           @arg @ref LL_GPIO_PIN_12
  *           @arg @ref LL_GPIO_PIN_13
  *           @arg @ref LL_GPIO_PIN_14
  *           @arg @ref LL_GPIO_PIN_15
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPIO_IsEnabledPinPullup(GPIO_Type *GPIOx, uint32_t Pin)
{
    return (uint32_t)(READ_BIT(GPIOx->PUEN, ((Pin & 0xFFFF) << 0x0U)) == ((Pin & 0xFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   ODEN        LL_GPIO_EnablePinOpendrain
  * @param    GPIOx GPIO Port
  * @param    Pin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_PIN_0
  *           @arg @ref LL_GPIO_PIN_1
  *           @arg @ref LL_GPIO_PIN_2
  *           @arg @ref LL_GPIO_PIN_3
  *           @arg @ref LL_GPIO_PIN_4
  *           @arg @ref LL_GPIO_PIN_5
  *           @arg @ref LL_GPIO_PIN_6
  *           @arg @ref LL_GPIO_PIN_7
  *           @arg @ref LL_GPIO_PIN_8
  *           @arg @ref LL_GPIO_PIN_9
  *           @arg @ref LL_GPIO_PIN_10
  *           @arg @ref LL_GPIO_PIN_11
  *           @arg @ref LL_GPIO_PIN_12
  *           @arg @ref LL_GPIO_PIN_13
  *           @arg @ref LL_GPIO_PIN_14
  *           @arg @ref LL_GPIO_PIN_15
  *           @arg @ref LL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_EnablePinOpendrain(GPIO_Type *GPIOx, uint32_t Pin)
{
    SET_BIT(GPIOx->ODEN, ((Pin & 0xFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   ODEN        LL_GPIO_DisablePinOpendrain
  * @param    GPIOx GPIO Port
  * @param    Pin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_PIN_0
  *           @arg @ref LL_GPIO_PIN_1
  *           @arg @ref LL_GPIO_PIN_2
  *           @arg @ref LL_GPIO_PIN_3
  *           @arg @ref LL_GPIO_PIN_4
  *           @arg @ref LL_GPIO_PIN_5
  *           @arg @ref LL_GPIO_PIN_6
  *           @arg @ref LL_GPIO_PIN_7
  *           @arg @ref LL_GPIO_PIN_8
  *           @arg @ref LL_GPIO_PIN_9
  *           @arg @ref LL_GPIO_PIN_10
  *           @arg @ref LL_GPIO_PIN_11
  *           @arg @ref LL_GPIO_PIN_12
  *           @arg @ref LL_GPIO_PIN_13
  *           @arg @ref LL_GPIO_PIN_14
  *           @arg @ref LL_GPIO_PIN_15
  *           @arg @ref LL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_DisablePinOpendrain(GPIO_Type *GPIOx, uint32_t Pin)
{
    CLEAR_BIT(GPIOx->ODEN, ((Pin & 0xFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   ODEN        LL_GPIO_IsEnabledPinOpendrain
  * @param    GPIOx GPIO Port
  * @param    Pin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_PIN_0
  *           @arg @ref LL_GPIO_PIN_1
  *           @arg @ref LL_GPIO_PIN_2
  *           @arg @ref LL_GPIO_PIN_3
  *           @arg @ref LL_GPIO_PIN_4
  *           @arg @ref LL_GPIO_PIN_5
  *           @arg @ref LL_GPIO_PIN_6
  *           @arg @ref LL_GPIO_PIN_7
  *           @arg @ref LL_GPIO_PIN_8
  *           @arg @ref LL_GPIO_PIN_9
  *           @arg @ref LL_GPIO_PIN_10
  *           @arg @ref LL_GPIO_PIN_11
  *           @arg @ref LL_GPIO_PIN_12
  *           @arg @ref LL_GPIO_PIN_13
  *           @arg @ref LL_GPIO_PIN_14
  *           @arg @ref LL_GPIO_PIN_15
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPIO_IsEnabledPinOpendrain(GPIO_Type *GPIOx, uint32_t Pin)
{
    return (uint32_t)(READ_BIT(GPIOx->ODEN, ((Pin & 0xFFFF) << 0x0U)) == ((Pin & 0xFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   DFS        LL_GPIO_EnablePinRemap
  * @param    GPIOx GPIO Port
  * @param    Pin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_PIN_0
  *           @arg @ref LL_GPIO_PIN_1
  *           @arg @ref LL_GPIO_PIN_2
  *           @arg @ref LL_GPIO_PIN_3
  *           @arg @ref LL_GPIO_PIN_4
  *           @arg @ref LL_GPIO_PIN_5
  *           @arg @ref LL_GPIO_PIN_6
  *           @arg @ref LL_GPIO_PIN_7
  *           @arg @ref LL_GPIO_PIN_8
  *           @arg @ref LL_GPIO_PIN_9
  *           @arg @ref LL_GPIO_PIN_10
  *           @arg @ref LL_GPIO_PIN_11
  *           @arg @ref LL_GPIO_PIN_12
  *           @arg @ref LL_GPIO_PIN_13
  *           @arg @ref LL_GPIO_PIN_14
  *           @arg @ref LL_GPIO_PIN_15
  *           @arg @ref LL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_EnablePinRemap(GPIO_Type *GPIOx, uint32_t Pin)
{
    SET_BIT(GPIOx->DFS, ((Pin & 0xFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   DFS        LL_GPIO_DisablePinRemap
  * @param    GPIOx GPIO Port
  * @param    Pin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_PIN_0
  *           @arg @ref LL_GPIO_PIN_1
  *           @arg @ref LL_GPIO_PIN_2
  *           @arg @ref LL_GPIO_PIN_3
  *           @arg @ref LL_GPIO_PIN_4
  *           @arg @ref LL_GPIO_PIN_5
  *           @arg @ref LL_GPIO_PIN_6
  *           @arg @ref LL_GPIO_PIN_7
  *           @arg @ref LL_GPIO_PIN_8
  *           @arg @ref LL_GPIO_PIN_9
  *           @arg @ref LL_GPIO_PIN_10
  *           @arg @ref LL_GPIO_PIN_11
  *           @arg @ref LL_GPIO_PIN_12
  *           @arg @ref LL_GPIO_PIN_13
  *           @arg @ref LL_GPIO_PIN_14
  *           @arg @ref LL_GPIO_PIN_15
  *           @arg @ref LL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_DisablePinRemap(GPIO_Type *GPIOx, uint32_t Pin)
{
    CLEAR_BIT(GPIOx->DFS, ((Pin & 0xFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   DFS        LL_GPIO_IsEnabledPinRemap
  * @param    GPIOx GPIO Port
  * @param    Pin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_PIN_0
  *           @arg @ref LL_GPIO_PIN_1
  *           @arg @ref LL_GPIO_PIN_2
  *           @arg @ref LL_GPIO_PIN_3
  *           @arg @ref LL_GPIO_PIN_4
  *           @arg @ref LL_GPIO_PIN_5
  *           @arg @ref LL_GPIO_PIN_6
  *           @arg @ref LL_GPIO_PIN_7
  *           @arg @ref LL_GPIO_PIN_8
  *           @arg @ref LL_GPIO_PIN_9
  *           @arg @ref LL_GPIO_PIN_10
  *           @arg @ref LL_GPIO_PIN_11
  *           @arg @ref LL_GPIO_PIN_12
  *           @arg @ref LL_GPIO_PIN_13
  *           @arg @ref LL_GPIO_PIN_14
  *           @arg @ref LL_GPIO_PIN_15
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPIO_IsEnabledPinRemap(GPIO_Type *GPIOx, uint32_t Pin)
{
    return (uint32_t)(READ_BIT(GPIOx->DFS, ((Pin & 0xFFFF) << 0x0U)) == ((Pin & 0xFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   ANEN        LL_GPIO_EnablePinAnalog
  * @param    GPIOx GPIO Port
  * @param    Pin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_PIN_0
  *           @arg @ref LL_GPIO_PIN_1
  *           @arg @ref LL_GPIO_PIN_2
  *           @arg @ref LL_GPIO_PIN_3
  *           @arg @ref LL_GPIO_PIN_4
  *           @arg @ref LL_GPIO_PIN_5
  *           @arg @ref LL_GPIO_PIN_6
  *           @arg @ref LL_GPIO_PIN_7
  *           @arg @ref LL_GPIO_PIN_8
  *           @arg @ref LL_GPIO_PIN_9
  *           @arg @ref LL_GPIO_PIN_10
  *           @arg @ref LL_GPIO_PIN_11
  *           @arg @ref LL_GPIO_PIN_12
  *           @arg @ref LL_GPIO_PIN_13
  *           @arg @ref LL_GPIO_PIN_14
  *           @arg @ref LL_GPIO_PIN_15
  *           @arg @ref LL_GPIO_PIN_ALL
  *           @arg @ref LL_GPIO_EXTI_LINE_0
  *           @arg @ref LL_GPIO_EXTI_LINE_1
  *           @arg @ref LL_GPIO_EXTI_LINE_2
  *           @arg @ref LL_GPIO_EXTI_LINE_3
  *           @arg @ref LL_GPIO_EXTI_LINE_4
  *           @arg @ref LL_GPIO_EXTI_LINE_7
  *           @arg @ref LL_GPIO_EXTI_LINE_8
  *           @arg @ref LL_GPIO_EXTI_LINE_9
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_EnablePinAnalog(GPIO_Type *GPIOx, uint32_t Pin)
{
    SET_BIT(GPIOx->ANEN, ((Pin & 0xFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   ANEN        LL_GPIO_DisablePinAnalog
  * @param    GPIOx GPIO Port
  * @param    Pin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_PIN_0
  *           @arg @ref LL_GPIO_PIN_1
  *           @arg @ref LL_GPIO_PIN_2
  *           @arg @ref LL_GPIO_PIN_3
  *           @arg @ref LL_GPIO_PIN_4
  *           @arg @ref LL_GPIO_PIN_5
  *           @arg @ref LL_GPIO_PIN_6
  *           @arg @ref LL_GPIO_PIN_7
  *           @arg @ref LL_GPIO_PIN_8
  *           @arg @ref LL_GPIO_PIN_9
  *           @arg @ref LL_GPIO_PIN_10
  *           @arg @ref LL_GPIO_PIN_11
  *           @arg @ref LL_GPIO_PIN_12
  *           @arg @ref LL_GPIO_PIN_13
  *           @arg @ref LL_GPIO_PIN_14
  *           @arg @ref LL_GPIO_PIN_15
  *           @arg @ref LL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_DisablePinAnalog(GPIO_Type *GPIOx, uint32_t Pin)
{
    CLEAR_BIT(GPIOx->ANEN, ((Pin & 0xFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   ANEN        LL_GPIO_IsEnabledPinAnalog
  * @param    GPIOx GPIO Port
  * @param    Pin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_PIN_0
  *           @arg @ref LL_GPIO_PIN_1
  *           @arg @ref LL_GPIO_PIN_2
  *           @arg @ref LL_GPIO_PIN_3
  *           @arg @ref LL_GPIO_PIN_4
  *           @arg @ref LL_GPIO_PIN_5
  *           @arg @ref LL_GPIO_PIN_6
  *           @arg @ref LL_GPIO_PIN_7
  *           @arg @ref LL_GPIO_PIN_8
  *           @arg @ref LL_GPIO_PIN_9
  *           @arg @ref LL_GPIO_PIN_10
  *           @arg @ref LL_GPIO_PIN_11
  *           @arg @ref LL_GPIO_PIN_12
  *           @arg @ref LL_GPIO_PIN_13
  *           @arg @ref LL_GPIO_PIN_14
  *           @arg @ref LL_GPIO_PIN_15
  *           @arg @ref LL_GPIO_PIN_ALL
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPIO_IsEnabledPinAnalog(GPIO_Type *GPIOx, uint32_t Pin)
{
    return (uint32_t)(READ_BIT(GPIOx->ANEN, ((Pin & 0xFFFF) << 0x0U)) == ((Pin & 0xFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   FCR        LL_GPIO_SetPinMode
  * @param    GPIOx GPIO Port
  * @param    Pin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_PIN_0
  *           @arg @ref LL_GPIO_PIN_1
  *           @arg @ref LL_GPIO_PIN_2
  *           @arg @ref LL_GPIO_PIN_3
  *           @arg @ref LL_GPIO_PIN_4
  *           @arg @ref LL_GPIO_PIN_5
  *           @arg @ref LL_GPIO_PIN_6
  *           @arg @ref LL_GPIO_PIN_7
  *           @arg @ref LL_GPIO_PIN_8
  *           @arg @ref LL_GPIO_PIN_9
  *           @arg @ref LL_GPIO_PIN_10
  *           @arg @ref LL_GPIO_PIN_11
  *           @arg @ref LL_GPIO_PIN_12
  *           @arg @ref LL_GPIO_PIN_13
  *           @arg @ref LL_GPIO_PIN_14
  *           @arg @ref LL_GPIO_PIN_15
  * @param    Mode This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_MODE_INPUT
  *           @arg @ref LL_GPIO_MODE_OUTPUT
  *           @arg @ref LL_GPIO_MODE_DIGITAL
  *           @arg @ref LL_GPIO_MODE_ANALOG
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_SetPinMode(GPIO_Type *GPIOx, uint32_t Pin, uint32_t Mode)
{
    MODIFY_REG(GPIOx->FCR, ((Pin * Pin) * GPIO_FCR), ((Pin * Pin) * Mode));
}

/**
  * @brief    
  * @rmtoll   FCR        LL_GPIO_GetPinMode
  * @param    GPIOx GPIO Port
  * @param    Pin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_PIN_0
  *           @arg @ref LL_GPIO_PIN_1
  *           @arg @ref LL_GPIO_PIN_2
  *           @arg @ref LL_GPIO_PIN_3
  *           @arg @ref LL_GPIO_PIN_4
  *           @arg @ref LL_GPIO_PIN_5
  *           @arg @ref LL_GPIO_PIN_6
  *           @arg @ref LL_GPIO_PIN_7
  *           @arg @ref LL_GPIO_PIN_8
  *           @arg @ref LL_GPIO_PIN_9
  *           @arg @ref LL_GPIO_PIN_10
  *           @arg @ref LL_GPIO_PIN_11
  *           @arg @ref LL_GPIO_PIN_12
  *           @arg @ref LL_GPIO_PIN_13
  *           @arg @ref LL_GPIO_PIN_14
  *           @arg @ref LL_GPIO_PIN_15
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPIO_MODE_INPUT
  *           @arg @ref LL_GPIO_MODE_OUTPUT
  *           @arg @ref LL_GPIO_MODE_DIGITAL
  *           @arg @ref LL_GPIO_MODE_ANALOG
  */
__STATIC_INLINE uint32_t LL_GPIO_GetPinMode(GPIO_Type *GPIOx, uint32_t Pin)
{
    return (uint32_t)(READ_BIT(GPIOx->FCR, ((Pin * Pin) * GPIO_FCR)) / (Pin * Pin));
}

/**
  * @brief    
  * @rmtoll   DO        LL_GPIO_WriteOutputPort
  * @param    GPIOx GPIO Port
  * @param    PortValue Level value for each pin of the port
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_WriteOutputPort(GPIO_Type *GPIOx, uint32_t PortValue)
{
    MODIFY_REG(GPIOx->DO, (0xFFFFU << 0U), (PortValue << 0U));
}

/**
  * @brief    
  * @rmtoll   DO        LL_GPIO_ReadOutputPort
  * @param    GPIOx GPIO Port
  * @retval   Output data register value of port
  */
__STATIC_INLINE uint32_t LL_GPIO_ReadOutputPort(GPIO_Type *GPIOx)
{
    return (uint32_t)(READ_BIT(GPIOx->DO, 0xFFFFU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   DO        LL_GPIO_IsOutputPinSet
  * @param    GPIOx GPIO Port
  * @param    Pin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_PIN_0
  *           @arg @ref LL_GPIO_PIN_1
  *           @arg @ref LL_GPIO_PIN_2
  *           @arg @ref LL_GPIO_PIN_3
  *           @arg @ref LL_GPIO_PIN_4
  *           @arg @ref LL_GPIO_PIN_5
  *           @arg @ref LL_GPIO_PIN_6
  *           @arg @ref LL_GPIO_PIN_7
  *           @arg @ref LL_GPIO_PIN_8
  *           @arg @ref LL_GPIO_PIN_9
  *           @arg @ref LL_GPIO_PIN_10
  *           @arg @ref LL_GPIO_PIN_11
  *           @arg @ref LL_GPIO_PIN_12
  *           @arg @ref LL_GPIO_PIN_13
  *           @arg @ref LL_GPIO_PIN_14
  *           @arg @ref LL_GPIO_PIN_15
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPIO_IsOutputPinSet(GPIO_Type *GPIOx, uint32_t Pin)
{
    return (uint32_t)(READ_BIT(GPIOx->DO, ((Pin & 0xFFFF) << 0x0U)) == ((Pin & 0xFFFF) << 0x0U));
}

