xdu-aero-association/FM33LC0XX_Example_0.04/CRC 示例/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_gpio.h
/**
  * @brief    
  * @rmtoll   DO        LL_GPIO_ToggleOutputPin
  * @param    GPIOx GPIO Port
  * @param    Pin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_PIN_0
  *           @arg @ref LL_GPIO_PIN_1
  *           @arg @ref LL_GPIO_PIN_2
  *           @arg @ref LL_GPIO_PIN_3
  *           @arg @ref LL_GPIO_PIN_4
  *           @arg @ref LL_GPIO_PIN_5
  *           @arg @ref LL_GPIO_PIN_6
  *           @arg @ref LL_GPIO_PIN_7
  *           @arg @ref LL_GPIO_PIN_8
  *           @arg @ref LL_GPIO_PIN_9
  *           @arg @ref LL_GPIO_PIN_10
  *           @arg @ref LL_GPIO_PIN_11
  *           @arg @ref LL_GPIO_PIN_12
  *           @arg @ref LL_GPIO_PIN_13
  *           @arg @ref LL_GPIO_PIN_14
  *           @arg @ref LL_GPIO_PIN_15
  *           @arg @ref LL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_ToggleOutputPin(GPIO_Type *GPIOx, uint32_t Pin)
{
    WRITE_REG(GPIOx->DO, READ_REG(GPIOx->DO) ^ Pin);
}

/**
  * @brief    
  * @rmtoll   DIN        LL_GPIO_ReadInputPort
  * @param    GPIOx GPIO Port
  * @retval   Input data register value of port
  */
__STATIC_INLINE uint32_t LL_GPIO_ReadInputPort(GPIO_Type *GPIOx)
{
    return (uint32_t)(READ_BIT(GPIOx->DIN, 0xFFFFU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   DIN        LL_GPIO_IsInputPinSet
  * @param    GPIOx GPIO Port
  * @param    Pin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_PIN_0
  *           @arg @ref LL_GPIO_PIN_1
  *           @arg @ref LL_GPIO_PIN_2
  *           @arg @ref LL_GPIO_PIN_3
  *           @arg @ref LL_GPIO_PIN_4
  *           @arg @ref LL_GPIO_PIN_5
  *           @arg @ref LL_GPIO_PIN_6
  *           @arg @ref LL_GPIO_PIN_7
  *           @arg @ref LL_GPIO_PIN_8
  *           @arg @ref LL_GPIO_PIN_9
  *           @arg @ref LL_GPIO_PIN_10
  *           @arg @ref LL_GPIO_PIN_11
  *           @arg @ref LL_GPIO_PIN_12
  *           @arg @ref LL_GPIO_PIN_13
  *           @arg @ref LL_GPIO_PIN_14
  *           @arg @ref LL_GPIO_PIN_15
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPIO_IsInputPinSet(GPIO_Type *GPIOx, uint32_t Pin)
{
    return (uint32_t)(READ_BIT(GPIOx->DIN, ((Pin & 0xFFFF) << 0x0U)) == ((Pin & 0xFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   DSET        LL_GPIO_SetOutputPin
  * @param    GPIOx GPIO Port
  * @param    Pin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_PIN_0
  *           @arg @ref LL_GPIO_PIN_1
  *           @arg @ref LL_GPIO_PIN_2
  *           @arg @ref LL_GPIO_PIN_3
  *           @arg @ref LL_GPIO_PIN_4
  *           @arg @ref LL_GPIO_PIN_5
  *           @arg @ref LL_GPIO_PIN_6
  *           @arg @ref LL_GPIO_PIN_7
  *           @arg @ref LL_GPIO_PIN_8
  *           @arg @ref LL_GPIO_PIN_9
  *           @arg @ref LL_GPIO_PIN_10
  *           @arg @ref LL_GPIO_PIN_11
  *           @arg @ref LL_GPIO_PIN_12
  *           @arg @ref LL_GPIO_PIN_13
  *           @arg @ref LL_GPIO_PIN_14
  *           @arg @ref LL_GPIO_PIN_15
  *           @arg @ref LL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_SetOutputPin(GPIO_Type *GPIOx, uint32_t Pin)
{
    SET_BIT(GPIOx->DSET, ((Pin & 0xFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   DRST        LL_GPIO_ResetOutputPin
  * @param    GPIOx GPIO Port
  * @param    Pin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_PIN_0
  *           @arg @ref LL_GPIO_PIN_1
  *           @arg @ref LL_GPIO_PIN_2
  *           @arg @ref LL_GPIO_PIN_3
  *           @arg @ref LL_GPIO_PIN_4
  *           @arg @ref LL_GPIO_PIN_5
  *           @arg @ref LL_GPIO_PIN_6
  *           @arg @ref LL_GPIO_PIN_7
  *           @arg @ref LL_GPIO_PIN_8
  *           @arg @ref LL_GPIO_PIN_9
  *           @arg @ref LL_GPIO_PIN_10
  *           @arg @ref LL_GPIO_PIN_11
  *           @arg @ref LL_GPIO_PIN_12
  *           @arg @ref LL_GPIO_PIN_13
  *           @arg @ref LL_GPIO_PIN_14
  *           @arg @ref LL_GPIO_PIN_15
  *           @arg @ref LL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_ResetOutputPin(GPIO_Type *GPIOx, uint32_t Pin)
{
    SET_BIT(GPIOx->DRST, ((Pin & 0xFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   EXTIEDS        LL_EXTI_SetTrigEdge
  * @param    GPIO_Common GPIO_Common instance
  * @param    EXTILine This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_EXTI_LINE_0
  *           @arg @ref LL_GPIO_EXTI_LINE_1
  *           @arg @ref LL_GPIO_EXTI_LINE_2
  *           @arg @ref LL_GPIO_EXTI_LINE_3
  *           @arg @ref LL_GPIO_EXTI_LINE_4
  *           @arg @ref LL_GPIO_EXTI_LINE_5
  *           @arg @ref LL_GPIO_EXTI_LINE_6
  *           @arg @ref LL_GPIO_EXTI_LINE_7
  *           @arg @ref LL_GPIO_EXTI_LINE_8
  *           @arg @ref LL_GPIO_EXTI_LINE_9
  *           @arg @ref LL_GPIO_EXTI_LINE_10
  *           @arg @ref LL_GPIO_EXTI_LINE_11
  *           @arg @ref LL_GPIO_EXTI_LINE_12
  *           @arg @ref LL_GPIO_EXTI_LINE_13
  *           @arg @ref LL_GPIO_EXTI_LINE_14
  *           @arg @ref LL_GPIO_EXTI_LINE_15
  * @param    TrigEdge This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_EXTI_TRIGGER_RISING
  *           @arg @ref LL_GPIO_EXTI_TRIGGER_FALLING
  *           @arg @ref LL_GPIO_EXTI_TRIGGER_BOTHEDGE
  *           @arg @ref LL_GPIO_EXTI_TRIGGER_NONE
  * @retval   None
  */
__STATIC_INLINE void LL_EXTI_SetTrigEdge(GPIO_COMMON_Type *GPIO_Common, uint32_t EXTILine, uint32_t TrigEdge)
{
    MODIFY_REG(GPIO_Common->EXTIEDS, ((EXTILine * EXTILine) * GPIO_EXTIEDS), ((EXTILine * EXTILine) * TrigEdge));
}

/**
  * @brief    
  * @rmtoll   EXTIEDS        LL_EXTI_GetTrigEdge
  * @param    GPIO_Common GPIO_Common instance
  * @param    EXTILine This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_EXTI_LINE_0
  *           @arg @ref LL_GPIO_EXTI_LINE_1
  *           @arg @ref LL_GPIO_EXTI_LINE_2
  *           @arg @ref LL_GPIO_EXTI_LINE_3
  *           @arg @ref LL_GPIO_EXTI_LINE_4
  *           @arg @ref LL_GPIO_EXTI_LINE_5
  *           @arg @ref LL_GPIO_EXTI_LINE_6
  *           @arg @ref LL_GPIO_EXTI_LINE_7
  *           @arg @ref LL_GPIO_EXTI_LINE_8
  *           @arg @ref LL_GPIO_EXTI_LINE_9
  *           @arg @ref LL_GPIO_EXTI_LINE_10
  *           @arg @ref LL_GPIO_EXTI_LINE_11
  *           @arg @ref LL_GPIO_EXTI_LINE_12
  *           @arg @ref LL_GPIO_EXTI_LINE_13
  *           @arg @ref LL_GPIO_EXTI_LINE_14
  *           @arg @ref LL_GPIO_EXTI_LINE_15
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPIO_EXTI_TRIGGER_RISING
  *           @arg @ref LL_GPIO_EXTI_TRIGGER_FALLING
  *           @arg @ref LL_GPIO_EXTI_TRIGGER_BOTHEDGE
  *           @arg @ref LL_GPIO_EXTI_TRIGGER_NONE
  */
__STATIC_INLINE uint32_t LL_EXTI_GetTrigEdge(GPIO_COMMON_Type *GPIO_Common, uint32_t EXTILine)
{
    return (uint32_t)(READ_BIT(GPIO_Common->EXTIEDS, ((EXTILine * EXTILine) * GPIO_EXTIEDS)) / (EXTILine * EXTILine));
}

/**
  * @brief    
  * @rmtoll   EXTIDF        LL_EXTI_EnableDigitalFilter
  * @param    GPIO_Common GPIO_Common instance
  * @param    EXTILine This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_EXTI_LINE_0
  *           @arg @ref LL_GPIO_EXTI_LINE_1
  *           @arg @ref LL_GPIO_EXTI_LINE_2
  *           @arg @ref LL_GPIO_EXTI_LINE_3
  *           @arg @ref LL_GPIO_EXTI_LINE_4
  *           @arg @ref LL_GPIO_EXTI_LINE_5
  *           @arg @ref LL_GPIO_EXTI_LINE_6
  *           @arg @ref LL_GPIO_EXTI_LINE_7
  *           @arg @ref LL_GPIO_EXTI_LINE_8
  *           @arg @ref LL_GPIO_EXTI_LINE_9
  *           @arg @ref LL_GPIO_EXTI_LINE_10
  *           @arg @ref LL_GPIO_EXTI_LINE_11
  *           @arg @ref LL_GPIO_EXTI_LINE_12
  *           @arg @ref LL_GPIO_EXTI_LINE_13
  *           @arg @ref LL_GPIO_EXTI_LINE_14
  *           @arg @ref LL_GPIO_EXTI_LINE_15
  *           @arg @ref LL_GPIO_EXTI_LINE_ALL
  * @retval   None
  */
__STATIC_INLINE void LL_EXTI_EnableDigitalFilter(GPIO_COMMON_Type *GPIO_Common, uint32_t EXTILine)
{
    SET_BIT(GPIO_Common->EXTIDF, ((EXTILine & 0xFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   EXTIDF        LL_EXTI_DisableDigitalFilter
  * @param    GPIO_Common GPIO_Common instance
  * @param    EXTILine This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_EXTI_LINE_0
  *           @arg @ref LL_GPIO_EXTI_LINE_1
  *           @arg @ref LL_GPIO_EXTI_LINE_2
  *           @arg @ref LL_GPIO_EXTI_LINE_3
  *           @arg @ref LL_GPIO_EXTI_LINE_4
  *           @arg @ref LL_GPIO_EXTI_LINE_5
  *           @arg @ref LL_GPIO_EXTI_LINE_6
  *           @arg @ref LL_GPIO_EXTI_LINE_7
  *           @arg @ref LL_GPIO_EXTI_LINE_8
  *           @arg @ref LL_GPIO_EXTI_LINE_9
  *           @arg @ref LL_GPIO_EXTI_LINE_10
  *           @arg @ref LL_GPIO_EXTI_LINE_11
  *           @arg @ref LL_GPIO_EXTI_LINE_12
  *           @arg @ref LL_GPIO_EXTI_LINE_13
  *           @arg @ref LL_GPIO_EXTI_LINE_14
  *           @arg @ref LL_GPIO_EXTI_LINE_15
  *           @arg @ref LL_GPIO_EXTI_LINE_ALL
  * @retval   None
  */
__STATIC_INLINE void LL_EXTI_DisableDigitalFilter(GPIO_COMMON_Type *GPIO_Common, uint32_t EXTILine)
{
    CLEAR_BIT(GPIO_Common->EXTIDF, ((EXTILine & 0xFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   EXTIDF        LL_EXTI_IsEnabledDigitalFilter
  * @param    GPIO_Common GPIO_Common instance
  * @param    EXTILine This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_EXTI_LINE_0
  *           @arg @ref LL_GPIO_EXTI_LINE_1
  *           @arg @ref LL_GPIO_EXTI_LINE_2
  *           @arg @ref LL_GPIO_EXTI_LINE_3
  *           @arg @ref LL_GPIO_EXTI_LINE_4
  *           @arg @ref LL_GPIO_EXTI_LINE_5
  *           @arg @ref LL_GPIO_EXTI_LINE_6
  *           @arg @ref LL_GPIO_EXTI_LINE_7
  *           @arg @ref LL_GPIO_EXTI_LINE_8
  *           @arg @ref LL_GPIO_EXTI_LINE_9
  *           @arg @ref LL_GPIO_EXTI_LINE_10
  *           @arg @ref LL_GPIO_EXTI_LINE_11
  *           @arg @ref LL_GPIO_EXTI_LINE_12
  *           @arg @ref LL_GPIO_EXTI_LINE_13
  *           @arg @ref LL_GPIO_EXTI_LINE_14
  *           @arg @ref LL_GPIO_EXTI_LINE_15
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledDigitalFilter(GPIO_COMMON_Type *GPIO_Common, uint32_t EXTILine)
{
    return (uint32_t)(READ_BIT(GPIO_Common->EXTIDF, ((EXTILine & 0xFFFF) << 0x0U)) == ((EXTILine & 0xFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   EXTIISR        LL_EXTI_IsActiveFlag
  * @param    GPIO_Common GPIO_Common instance
  * @param    EXTILine This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_EXTI_LINE_0
  *           @arg @ref LL_GPIO_EXTI_LINE_1
  *           @arg @ref LL_GPIO_EXTI_LINE_2
  *           @arg @ref LL_GPIO_EXTI_LINE_3
  *           @arg @ref LL_GPIO_EXTI_LINE_4
  *           @arg @ref LL_GPIO_EXTI_LINE_5
  *           @arg @ref LL_GPIO_EXTI_LINE_6
  *           @arg @ref LL_GPIO_EXTI_LINE_7
  *           @arg @ref LL_GPIO_EXTI_LINE_8
  *           @arg @ref LL_GPIO_EXTI_LINE_9
  *           @arg @ref LL_GPIO_EXTI_LINE_10
  *           @arg @ref LL_GPIO_EXTI_LINE_11
  *           @arg @ref LL_GPIO_EXTI_LINE_12
  *           @arg @ref LL_GPIO_EXTI_LINE_13
  *           @arg @ref LL_GPIO_EXTI_LINE_14
  *           @arg @ref LL_GPIO_EXTI_LINE_15
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsActiveFlag(GPIO_COMMON_Type *GPIO_Common, uint32_t EXTILine)
{
    return (uint32_t)(READ_BIT(GPIO_Common->EXTIISR, ((EXTILine & 0xFFFF) << 0x0U)) == ((EXTILine & 0xFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   EXTIISR        LL_EXTI_ClearFlag
  * @param    GPIO_Common GPIO_Common instance
  * @param    EXTILine This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_EXTI_LINE_0
  *           @arg @ref LL_GPIO_EXTI_LINE_1
  *           @arg @ref LL_GPIO_EXTI_LINE_2
  *           @arg @ref LL_GPIO_EXTI_LINE_3
  *           @arg @ref LL_GPIO_EXTI_LINE_4
  *           @arg @ref LL_GPIO_EXTI_LINE_5
  *           @arg @ref LL_GPIO_EXTI_LINE_6
  *           @arg @ref LL_GPIO_EXTI_LINE_7
  *           @arg @ref LL_GPIO_EXTI_LINE_8
  *           @arg @ref LL_GPIO_EXTI_LINE_9
  *           @arg @ref LL_GPIO_EXTI_LINE_10
  *           @arg @ref LL_GPIO_EXTI_LINE_11
  *           @arg @ref LL_GPIO_EXTI_LINE_12
  *           @arg @ref LL_GPIO_EXTI_LINE_13
  *           @arg @ref LL_GPIO_EXTI_LINE_14
  *           @arg @ref LL_GPIO_EXTI_LINE_15
  *           @arg @ref LL_GPIO_EXTI_LINE_ALL
  * @retval   None
  */
__STATIC_INLINE void LL_EXTI_ClearFlag(GPIO_COMMON_Type *GPIO_Common, uint32_t EXTILine)
{
    WRITE_REG(GPIO_Common->EXTIISR, ((EXTILine & 0xFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   EXTIDI        LL_EXTI_IsEXTILineSet
  * @param    GPIO_Common GPIO_Common instance
  * @param    EXTILine This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_EXTI_LINE_0
  *           @arg @ref LL_GPIO_EXTI_LINE_1
  *           @arg @ref LL_GPIO_EXTI_LINE_2
  *           @arg @ref LL_GPIO_EXTI_LINE_3
  *           @arg @ref LL_GPIO_EXTI_LINE_4
  *           @arg @ref LL_GPIO_EXTI_LINE_5
  *           @arg @ref LL_GPIO_EXTI_LINE_6
  *           @arg @ref LL_GPIO_EXTI_LINE_7
  *           @arg @ref LL_GPIO_EXTI_LINE_8
  *           @arg @ref LL_GPIO_EXTI_LINE_9
  *           @arg @ref LL_GPIO_EXTI_LINE_10
  *           @arg @ref LL_GPIO_EXTI_LINE_11
  *           @arg @ref LL_GPIO_EXTI_LINE_12
  *           @arg @ref LL_GPIO_EXTI_LINE_13
  *           @arg @ref LL_GPIO_EXTI_LINE_14
  *           @arg @ref LL_GPIO_EXTI_LINE_15
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEXTILineSet(GPIO_COMMON_Type *GPIO_Common, uint32_t EXTILine)
{
    return (uint32_t)(READ_BIT(GPIO_Common->EXTIDI, ((EXTILine & 0xFFFF) << 0x0U)) == ((EXTILine & 0xFFFF) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   EXTIDI        LL_EXTI_ReadEXTILines
  * @param    GPIO_Common GPIO_Common instance
  * @retval   EXTI data register value of port
  */
__STATIC_INLINE uint32_t LL_EXTI_ReadEXTILines(GPIO_COMMON_Type *GPIO_Common)
{
    return (uint32_t)(READ_BIT(GPIO_Common->EXTIDI, 0xFFFFU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   FOUTSEL    FOUT0    LL_GPIO_SetFout0
  * @param    GPIO_Common GPIO_Common instance
  * @param    FoutSel This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_FOUT0_SELECT_XTLF             
  *           @arg @ref LL_GPIO_FOUT0_SELECT_RCLP             
  *           @arg @ref LL_GPIO_FOUT0_SELECT_RCHF_DIV64       
  *           @arg @ref LL_GPIO_FOUT0_SELECT_LSCLK            
  *           @arg @ref LL_GPIO_FOUT0_SELECT_AHBCLK_DIV64     
  *           @arg @ref LL_GPIO_FOUT0_SELECT_RTCTM            
  *           @arg @ref LL_GPIO_FOUT0_SELECT_PLLOUTPUT_DIV64  
  *           @arg @ref LL_GPIO_FOUT0_SELECT_RTCCLK64Hz       
  *           @arg @ref LL_GPIO_FOUT0_SELECT_APBCLK_DIV64     
  *           @arg @ref LL_GPIO_FOUT0_SELECT_PLLOUTPUT        
  *           @arg @ref LL_GPIO_FOUT0_SELECT_RC4M_PSC         
  *           @arg @ref LL_GPIO_FOUT0_SELECT_RCHF             
  *           @arg @ref LL_GPIO_FOUT0_SELECT_XTHF_DIV64       
  *           @arg @ref LL_GPIO_FOUT0_SELECT_COMP1_OUTPUT     
  *           @arg @ref LL_GPIO_FOUT0_SELECT_CLK_8K           
  *           @arg @ref LL_GPIO_FOUT0_SELECT_ADC_CLK          
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_SetFout0(GPIO_COMMON_Type *GPIO_Common, uint32_t FoutSel)
{
    MODIFY_REG(GPIO_Common->FOUTSEL, GPIO_FOUTSEL_FOUT0_Msk, FoutSel);
}

/**
  * @brief    
  * @rmtoll   FOUTSEL    FOUT0    LL_GPIO_GetFout0
  * @param    GPIO_Common GPIO_Common instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPIO_FOUT0_SELECT_XTLF             
  *           @arg @ref LL_GPIO_FOUT0_SELECT_RCLP             
  *           @arg @ref LL_GPIO_FOUT0_SELECT_RCHF_DIV64       
  *           @arg @ref LL_GPIO_FOUT0_SELECT_LSCLK            
  *           @arg @ref LL_GPIO_FOUT0_SELECT_AHBCLK_DIV64     
  *           @arg @ref LL_GPIO_FOUT0_SELECT_RTCTM            
  *           @arg @ref LL_GPIO_FOUT0_SELECT_PLLOUTPUT_DIV64  
  *           @arg @ref LL_GPIO_FOUT0_SELECT_RTCCLK64Hz       
  *           @arg @ref LL_GPIO_FOUT0_SELECT_APBCLK_DIV64     
  *           @arg @ref LL_GPIO_FOUT0_SELECT_PLLOUTPUT        
  *           @arg @ref LL_GPIO_FOUT0_SELECT_RC4M_PSC         
  *           @arg @ref LL_GPIO_FOUT0_SELECT_RCHF             
  *           @arg @ref LL_GPIO_FOUT0_SELECT_XTHF_DIV64       
  *           @arg @ref LL_GPIO_FOUT0_SELECT_COMP1_OUTPUT     
  *           @arg @ref LL_GPIO_FOUT0_SELECT_CLK_8K           
  *           @arg @ref LL_GPIO_FOUT0_SELECT_ADC_CLK          
  */
__STATIC_INLINE uint32_t LL_GPIO_GetFout0(GPIO_COMMON_Type *GPIO_Common)
{
    return (uint32_t)(READ_BIT(GPIO_Common->FOUTSEL, GPIO_FOUTSEL_FOUT0_Msk));
}

/**
  * @brief    
  * @rmtoll   FOUTSEL    FOUT1    LL_GPIO_SetFout1
  * @param    GPIO_Common GPIO_Common instance
  * @param    FoutSel This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_FOUT1_SELECT_XTLF
  *           @arg @ref LL_GPIO_FOUT1_SELECT_RCLP
  *           @arg @ref LL_GPIO_FOUT1_SELECT_RCHF_DIV64
  *           @arg @ref LL_GPIO_FOUT1_SELECT_LSCLK
  *           @arg @ref LL_GPIO_FOUT1_SELECT_AHBCLK_DIV64
  *           @arg @ref LL_GPIO_FOUT1_SELECT_RTCTM
  *           @arg @ref LL_GPIO_FOUT1_SELECT_PLLOUTPUT_DIV64
  *           @arg @ref LL_GPIO_FOUT1_SELECT_RTCCLK64Hz
  *           @arg @ref LL_GPIO_FOUT1_SELECT_APBCLK_DIV64
  *           @arg @ref LL_GPIO_FOUT1_SELECT_PLLOUTPUT
  *           @arg @ref LL_GPIO_FOUT1_SELECT_RC4M_PSC
  *           @arg @ref LL_GPIO_FOUT1_SELECT_RCHF
  *           @arg @ref LL_GPIO_FOUT1_SELECT_XTHF_DIV64
  *           @arg @ref LL_GPIO_FOUT1_SELECT_COMP1_OUTPUT
  *           @arg @ref LL_GPIO_FOUT1_SELECT_CLK_8K
  *           @arg @ref LL_GPIO_FOUT1_SELECT_COMP2_OUTPUT
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_SetFout1(GPIO_COMMON_Type *GPIO_Common, uint32_t FoutSel)
{
    MODIFY_REG(GPIO_Common->FOUTSEL, GPIO_FOUTSEL_FOUT1_Msk, FoutSel);
}

/**
  * @brief    
  * @rmtoll   FOUTSEL    FOUT1    LL_GPIO_GetFout1
  * @param    GPIO_Common GPIO_Common instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPIO_FOUT1_SELECT_XTLF
  *           @arg @ref LL_GPIO_FOUT1_SELECT_RCLP
  *           @arg @ref LL_GPIO_FOUT1_SELECT_RCHF_DIV64
  *           @arg @ref LL_GPIO_FOUT1_SELECT_LSCLK
  *           @arg @ref LL_GPIO_FOUT1_SELECT_AHBCLK_DIV64
  *           @arg @ref LL_GPIO_FOUT1_SELECT_RTCTM
  *           @arg @ref LL_GPIO_FOUT1_SELECT_PLLOUTPUT_DIV64
  *           @arg @ref LL_GPIO_FOUT1_SELECT_RTCCLK64Hz
  *           @arg @ref LL_GPIO_FOUT1_SELECT_APBCLK_DIV64
  *           @arg @ref LL_GPIO_FOUT1_SELECT_PLLOUTPUT
  *           @arg @ref LL_GPIO_FOUT1_SELECT_RC4M_PSC
  *           @arg @ref LL_GPIO_FOUT1_SELECT_RCHF
  *           @arg @ref LL_GPIO_FOUT1_SELECT_XTHF_DIV64
  *           @arg @ref LL_GPIO_FOUT1_SELECT_COMP1_OUTPUT
  *           @arg @ref LL_GPIO_FOUT1_SELECT_CLK_8K
  *           @arg @ref LL_GPIO_FOUT1_SELECT_COMP2_OUTPUT
  */
__STATIC_INLINE uint32_t LL_GPIO_GetFout1(GPIO_COMMON_Type *GPIO_Common)
{
    return (uint32_t)(READ_BIT(GPIO_Common->FOUTSEL, GPIO_FOUTSEL_FOUT1_Msk));
}

/**
  * @brief    
  * @rmtoll   EXTISEL    EXTI0    LL_GPIO_SetExitLine0
  * @param    GPIO_Common GPIO_Common instance
  * @param    EXTIPin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_EXTI_LINE_0_PA0
  *           @arg @ref LL_GPIO_EXTI_LINE_0_PA1
  *           @arg @ref LL_GPIO_EXTI_LINE_0_PA2
  *           @arg @ref LL_GPIO_EXTI_LINE_0_PA3
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_SetExitLine0(GPIO_COMMON_Type *GPIO_Common, uint32_t EXTIPin)
{
    MODIFY_REG(GPIO_Common->EXTISEL, GPIO_EXTISEL_EXTI0_Msk, EXTIPin);
}

/**
  * @brief    
  * @rmtoll   EXTISEL    EXTI0    LL_GPIO_GetExitLine0
  * @param    GPIO_Common GPIO_Common instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t LL_GPIO_GetExitLine0(GPIO_COMMON_Type *GPIO_Common)
{
    return (uint32_t)(READ_BIT(GPIO_Common->EXTISEL, GPIO_EXTISEL_EXTI0_Msk));
}

/**
  * @brief    
  * @rmtoll   EXTISEL    EXTI1    LL_GPIO_SetExitLine1
  * @param    GPIO_Common GPIO_Common instance
  * @param    EXTIPin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_EXTI_LINE_1_PA4
  *           @arg @ref LL_GPIO_EXTI_LINE_1_PA5
  *           @arg @ref LL_GPIO_EXTI_LINE_1_PA6
  *           @arg @ref LL_GPIO_EXTI_LINE_1_PA7
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_SetExitLine1(GPIO_COMMON_Type *GPIO_Common, uint32_t EXTIPin)
{
    MODIFY_REG(GPIO_Common->EXTISEL, GPIO_EXTISEL_EXTI1_Msk, EXTIPin);
}

/**
  * @brief    
  * @rmtoll   EXTISEL    EXTI1    LL_GPIO_GetExitLine1
  * @param    GPIO_Common GPIO_Common instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t LL_GPIO_GetExitLine1(GPIO_COMMON_Type *GPIO_Common)
{
    return (uint32_t)(READ_BIT(GPIO_Common->EXTISEL, GPIO_EXTISEL_EXTI1_Msk));
}

/**
  * @brief    
  * @rmtoll   EXTISEL    EXTI2    LL_GPIO_SetExitLine2
  * @param    GPIO_Common GPIO_Common instance
  * @param    EXTIPin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_EXTI_LINE_2_PA8
  *           @arg @ref LL_GPIO_EXTI_LINE_2_PA9
  *           @arg @ref LL_GPIO_EXTI_LINE_2_PA10
  *           @arg @ref LL_GPIO_EXTI_LINE_2_PA11
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_SetExitLine2(GPIO_COMMON_Type *GPIO_Common, uint32_t EXTIPin)
{
    MODIFY_REG(GPIO_Common->EXTISEL, GPIO_EXTISEL_EXTI2_Msk, EXTIPin);
}

/**
  * @brief    
  * @rmtoll   EXTISEL    EXTI2    LL_GPIO_GetExitLine2
  * @param    GPIO_Common GPIO_Common instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t LL_GPIO_GetExitLine2(GPIO_COMMON_Type *GPIO_Common)
{
    return (uint32_t)(READ_BIT(GPIO_Common->EXTISEL, GPIO_EXTISEL_EXTI2_Msk));
}

/**
  * @brief    
  * @rmtoll   EXTISEL    EXTI3    LL_GPIO_SetExitLine3
  * @param    GPIO_Common GPIO_Common instance
  * @param    EXTIPin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_EXTI_LINE_3_PA12
  *           @arg @ref LL_GPIO_EXTI_LINE_3_PA13
  *           @arg @ref LL_GPIO_EXTI_LINE_3_PA14
  *           @arg @ref LL_GPIO_EXTI_LINE_3_PA15
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_SetExitLine3(GPIO_COMMON_Type *GPIO_Common, uint32_t EXTIPin)
{
    MODIFY_REG(GPIO_Common->EXTISEL, GPIO_EXTISEL_EXTI3_Msk, EXTIPin);
}

/**
  * @brief    
  * @rmtoll   EXTISEL    EXTI3    LL_GPIO_GetExitLine3
  * @param    GPIO_Common GPIO_Common instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t LL_GPIO_GetExitLine3(GPIO_COMMON_Type *GPIO_Common)
{
    return (uint32_t)(READ_BIT(GPIO_Common->EXTISEL, GPIO_EXTISEL_EXTI3_Msk));
}

/**
  * @brief    
  * @rmtoll   EXTISEL    EXTI4    LL_GPIO_SetExitLine4
  * @param    GPIO_Common GPIO_Common instance
  * @param    EXTIPin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_EXTI_LINE_4_PB0
  *           @arg @ref LL_GPIO_EXTI_LINE_4_PB1
  *           @arg @ref LL_GPIO_EXTI_LINE_4_PB2
  *           @arg @ref LL_GPIO_EXTI_LINE_4_PB3
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_SetExitLine4(GPIO_COMMON_Type *GPIO_Common, uint32_t EXTIPin)
{
    MODIFY_REG(GPIO_Common->EXTISEL, GPIO_EXTISEL_EXTI4_Msk, EXTIPin);
}

