xdu-aero-association/FM33LC0XX_Example_0.04/CRC 示例/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_gpio.h
/**
  * @brief    
  * @rmtoll   EXTISEL    EXTI4    LL_GPIO_GetExitLine4
  * @param    GPIO_Common GPIO_Common instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t LL_GPIO_GetExitLine4(GPIO_COMMON_Type *GPIO_Common)
{
    return (uint32_t)(READ_BIT(GPIO_Common->EXTISEL, GPIO_EXTISEL_EXTI4_Msk));
}

/**
  * @brief    
  * @rmtoll   EXTISEL    EXTI5    LL_GPIO_SetExitLine5
  * @param    GPIO_Common GPIO_Common instance
  * @param    EXTIPin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_EXTI_LINE_5_PB4
  *           @arg @ref LL_GPIO_EXTI_LINE_5_PB5
  *           @arg @ref LL_GPIO_EXTI_LINE_5_PB6
  *           @arg @ref LL_GPIO_EXTI_LINE_5_PB7
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_SetExitLine5(GPIO_COMMON_Type *GPIO_Common, uint32_t EXTIPin)
{
    MODIFY_REG(GPIO_Common->EXTISEL, GPIO_EXTISEL_EXTI5_Msk, EXTIPin);
}

/**
  * @brief    
  * @rmtoll   EXTISEL    EXTI5    LL_GPIO_GetExitLine5
  * @param    GPIO_Common GPIO_Common instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t LL_GPIO_GetExitLine5(GPIO_COMMON_Type *GPIO_Common)
{
    return (uint32_t)(READ_BIT(GPIO_Common->EXTISEL, GPIO_EXTISEL_EXTI5_Msk));
}

/**
  * @brief    
  * @rmtoll   EXTISEL    EXTI6    LL_GPIO_SetExitLine6
  * @param    GPIO_Common GPIO_Common instance
  * @param    EXTIPin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_EXTI_LINE_6_PB8
  *           @arg @ref LL_GPIO_EXTI_LINE_6_PB9
  *           @arg @ref LL_GPIO_EXTI_LINE_6_PB10
  *           @arg @ref LL_GPIO_EXTI_LINE_6_PB11
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_SetExitLine6(GPIO_COMMON_Type *GPIO_Common, uint32_t EXTIPin)
{
    MODIFY_REG(GPIO_Common->EXTISEL, GPIO_EXTISEL_EXTI6_Msk, EXTIPin);
}

/**
  * @brief    
  * @rmtoll   EXTISEL    EXTI6    LL_GPIO_GetExitLine6
  * @param    GPIO_Common GPIO_Common instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t LL_GPIO_GetExitLine6(GPIO_COMMON_Type *GPIO_Common)
{
    return (uint32_t)(READ_BIT(GPIO_Common->EXTISEL, GPIO_EXTISEL_EXTI6_Msk));
}

/**
  * @brief    
  * @rmtoll   EXTISEL    EXTI7    LL_GPIO_SetExitLine7
  * @param    GPIO_Common GPIO_Common instance
  * @param    EXTIPin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_EXTI_LINE_7_PB12
  *           @arg @ref LL_GPIO_EXTI_LINE_7_PB13
  *           @arg @ref LL_GPIO_EXTI_LINE_7_PB14
  *           @arg @ref LL_GPIO_EXTI_LINE_7_PB15
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_SetExitLine7(GPIO_COMMON_Type *GPIO_Common, uint32_t EXTIPin)
{
    MODIFY_REG(GPIO_Common->EXTISEL, GPIO_EXTISEL_EXTI7_Msk, EXTIPin);
}

/**
  * @brief    
  * @rmtoll   EXTISEL    EXTI7    LL_GPIO_GetExitLine7
  * @param    GPIO_Common GPIO_Common instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t LL_GPIO_GetExitLine7(GPIO_COMMON_Type *GPIO_Common)
{
    return (uint32_t)(READ_BIT(GPIO_Common->EXTISEL, GPIO_EXTISEL_EXTI7_Msk));
}

/**
  * @brief    
  * @rmtoll   EXTISEL    EXTI8    LL_GPIO_SetExitLine8
  * @param    GPIO_Common GPIO_Common instance
  * @param    EXTIPin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_EXTI_LINE_8_PC0
  *           @arg @ref LL_GPIO_EXTI_LINE_8_PC1
  *           @arg @ref LL_GPIO_EXTI_LINE_8_PC2
  *           @arg @ref LL_GPIO_EXTI_LINE_8_PC3
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_SetExitLine8(GPIO_COMMON_Type *GPIO_Common, uint32_t EXTIPin)
{
    MODIFY_REG(GPIO_Common->EXTISEL, GPIO_EXTISEL_EXTI8_Msk, EXTIPin);
}

/**
  * @brief    
  * @rmtoll   EXTISEL    EXTI8    LL_GPIO_GetExitLine8
  * @param    GPIO_Common GPIO_Common instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t LL_GPIO_GetExitLine8(GPIO_COMMON_Type *GPIO_Common)
{
    return (uint32_t)(READ_BIT(GPIO_Common->EXTISEL, GPIO_EXTISEL_EXTI8_Msk));
}

/**
  * @brief    
  * @rmtoll   EXTISEL    EXTI9    LL_GPIO_SetExitLine9
  * @param    GPIO_Common GPIO_Common instance
  * @param    EXTIPin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_EXTI_LINE_9_PC4
  *           @arg @ref LL_GPIO_EXTI_LINE_9_PC5
  *           @arg @ref LL_GPIO_EXTI_LINE_9_PC6
  *           @arg @ref LL_GPIO_EXTI_LINE_9_PC7
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_SetExitLine9(GPIO_COMMON_Type *GPIO_Common, uint32_t EXTIPin)
{
    MODIFY_REG(GPIO_Common->EXTISEL, GPIO_EXTISEL_EXTI9_Msk, EXTIPin);
}

/**
  * @brief    
  * @rmtoll   EXTISEL    EXTI9    LL_GPIO_GetExitLine9
  * @param    GPIO_Common GPIO_Common instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t LL_GPIO_GetExitLine9(GPIO_COMMON_Type *GPIO_Common)
{
    return (uint32_t)(READ_BIT(GPIO_Common->EXTISEL, GPIO_EXTISEL_EXTI9_Msk));
}

/**
  * @brief    
  * @rmtoll   EXTISEL    EXTI10    LL_GPIO_SetExitLine10
  * @param    GPIO_Common GPIO_Common instance
  * @param    EXTIPin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_EXTI_LINE_10_PC8
  *           @arg @ref LL_GPIO_EXTI_LINE_10_PC9
  *           @arg @ref LL_GPIO_EXTI_LINE_10_PC10
  *           @arg @ref LL_GPIO_EXTI_LINE_10_PC11
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_SetExitLine10(GPIO_COMMON_Type *GPIO_Common, uint32_t EXTIPin)
{
    MODIFY_REG(GPIO_Common->EXTISEL, GPIO_EXTISEL_EXTI10_Msk, EXTIPin);
}

/**
  * @brief    
  * @rmtoll   EXTISEL    EXTI10    LL_GPIO_GetExitLine10
  * @param    GPIO_Common GPIO_Common instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t LL_GPIO_GetExitLine10(GPIO_COMMON_Type *GPIO_Common)
{
    return (uint32_t)(READ_BIT(GPIO_Common->EXTISEL, GPIO_EXTISEL_EXTI10_Msk));
}

/**
  * @brief    
  * @rmtoll   EXTISEL    EXTI12    LL_GPIO_SetExitLine12
  * @param    GPIO_Common GPIO_Common instance
  * @param    EXTIPin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_EXTI_LINE_12_PD0
  *           @arg @ref LL_GPIO_EXTI_LINE_12_PD1
  *           @arg @ref LL_GPIO_EXTI_LINE_12_PD2
  *           @arg @ref LL_GPIO_EXTI_LINE_12_PD3
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_SetExitLine12(GPIO_COMMON_Type *GPIO_Common, uint32_t EXTIPin)
{
    MODIFY_REG(GPIO_Common->EXTISEL, GPIO_EXTISEL_EXTI12_Msk, EXTIPin);
}

/**
  * @brief    
  * @rmtoll   EXTISEL    EXTI12    LL_GPIO_GetExitLine12
  * @param    GPIO_Common GPIO_Common instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t LL_GPIO_GetExitLine12(GPIO_COMMON_Type *GPIO_Common)
{
    return (uint32_t)(READ_BIT(GPIO_Common->EXTISEL, GPIO_EXTISEL_EXTI12_Msk));
}

/**
  * @brief    
  * @rmtoll   EXTISEL    EXTI13    LL_GPIO_SetExitLine13
  * @param    GPIO_Common GPIO_Common instance
  * @param    EXTIPin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_EXTI_LINE_13_PD4
  *           @arg @ref LL_GPIO_EXTI_LINE_13_PD5
  *           @arg @ref LL_GPIO_EXTI_LINE_13_PD6
  *           @arg @ref LL_GPIO_EXTI_LINE_13_PD7
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_SetExitLine13(GPIO_COMMON_Type *GPIO_Common, uint32_t EXTIPin)
{
    MODIFY_REG(GPIO_Common->EXTISEL, GPIO_EXTISEL_EXTI13_Msk, EXTIPin);
}

/**
  * @brief    
  * @rmtoll   EXTISEL    EXTI13    LL_GPIO_GetExitLine13
  * @param    GPIO_Common GPIO_Common instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t LL_GPIO_GetExitLine13(GPIO_COMMON_Type *GPIO_Common)
{
    return (uint32_t)(READ_BIT(GPIO_Common->EXTISEL, GPIO_EXTISEL_EXTI13_Msk));
}

/**
  * @brief    
  * @rmtoll   EXTISEL    EXTI14    LL_GPIO_SetExitLine14
  * @param    GPIO_Common GPIO_Common instance
  * @param    EXTIPin This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_EXTI_LINE_14_PD8
  *           @arg @ref LL_GPIO_EXTI_LINE_14_PD9
  *           @arg @ref LL_GPIO_EXTI_LINE_14_PD10
  *           @arg @ref LL_GPIO_EXTI_LINE_14_PD11
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_SetExitLine14(GPIO_COMMON_Type *GPIO_Common, uint32_t EXTIPin)
{
    MODIFY_REG(GPIO_Common->EXTISEL, GPIO_EXTISEL_EXTI14_Msk, EXTIPin);
}

/**
  * @brief    
  * @rmtoll   EXTISEL    EXTI14    LL_GPIO_GetExitLine14
  * @param    GPIO_Common GPIO_Common instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t LL_GPIO_GetExitLine14(GPIO_COMMON_Type *GPIO_Common)
{
    return (uint32_t)(READ_BIT(GPIO_Common->EXTISEL, GPIO_EXTISEL_EXTI14_Msk));
}

/**
  * @brief    
  * @rmtoll   PINWKEN    EN    LL_GPIO_IsEnabledWkup
  * @param    GPIO_Common GPIO_Common instance
  * @param    Wkupx This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_WKUP_0
  *           @arg @ref LL_GPIO_WKUP_1
  *           @arg @ref LL_GPIO_WKUP_2
  *           @arg @ref LL_GPIO_WKUP_3
  *           @arg @ref LL_GPIO_WKUP_4
  *           @arg @ref LL_GPIO_WKUP_5
  *           @arg @ref LL_GPIO_WKUP_6
  *           @arg @ref LL_GPIO_WKUP_7
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_GPIO_IsEnabledWkup(GPIO_COMMON_Type *GPIO_Common, uint32_t Wkupx)
{
    return (uint32_t)(READ_BIT(GPIO_Common->PINWKEN, ((Wkupx & 0xff) << 0x0U)) == ((Wkupx & 0xff) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   PINWKEN    EN    LL_GPIO_EnableWkup
  * @param    GPIO_Common GPIO_Common instance
  * @param    Wkupx This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_WKUP_0
  *           @arg @ref LL_GPIO_WKUP_1
  *           @arg @ref LL_GPIO_WKUP_2
  *           @arg @ref LL_GPIO_WKUP_3
  *           @arg @ref LL_GPIO_WKUP_4
  *           @arg @ref LL_GPIO_WKUP_5
  *           @arg @ref LL_GPIO_WKUP_6
  *           @arg @ref LL_GPIO_WKUP_7
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_EnableWkup(GPIO_COMMON_Type *GPIO_Common, uint32_t Wkupx)
{
    SET_BIT(GPIO_Common->PINWKEN, ((Wkupx & 0xff) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   PINWKEN    EN    LL_GPIO_DisableWkup
  * @param    GPIO_Common GPIO_Common instance
  * @param    Wkupx This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_WKUP_0
  *           @arg @ref LL_GPIO_WKUP_1
  *           @arg @ref LL_GPIO_WKUP_2
  *           @arg @ref LL_GPIO_WKUP_3
  *           @arg @ref LL_GPIO_WKUP_4
  *           @arg @ref LL_GPIO_WKUP_5
  *           @arg @ref LL_GPIO_WKUP_6
  *           @arg @ref LL_GPIO_WKUP_7
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_DisableWkup(GPIO_COMMON_Type *GPIO_Common, uint32_t Wkupx)
{
    CLEAR_BIT(GPIO_Common->PINWKEN, ((Wkupx & 0xff) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   PINWKEN    WKISEL    LL_GPIO_GetWkupEntry 
  * @param    GPIO_Common GPIO_Common instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPIO_WKUP_INT_ENTRY_NMI
  *           @arg @ref LL_GPIO_WKUP_INT_ENTRY_NUM_38
  */
__STATIC_INLINE uint32_t LL_GPIO_GetWkupEntry (GPIO_COMMON_Type *GPIO_Common)
{
    return (uint32_t)(READ_BIT(GPIO_Common->PINWKEN, GPIO_PINWKEN_WKISEL_Msk));
}

/**
  * @brief    
  * @rmtoll   PINWKEN    WKISEL    LL_GPIO_SetWkupEntry
  * @param    GPIO_Common GPIO_Common instance
  * @param    Wkupx This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_WKUP_INT_ENTRY_NMI
  *           @arg @ref LL_GPIO_WKUP_INT_ENTRY_NUM_38
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_SetWkupEntry(GPIO_COMMON_Type *GPIO_Common, uint32_t Wkupx)
{
    MODIFY_REG(GPIO_Common->PINWKEN, GPIO_PINWKEN_WKISEL_Msk, Wkupx);
}

/**
  * @brief    
  * @rmtoll   PINWKEN        LL_GPIO_SetWkupPolarity
  * @param    GPIO_Common GPIO_Common instance
  * @param    Wkupx This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_WKUP_0
  *           @arg @ref LL_GPIO_WKUP_1
  *           @arg @ref LL_GPIO_WKUP_2
  *           @arg @ref LL_GPIO_WKUP_3
  *           @arg @ref LL_GPIO_WKUP_4
  *           @arg @ref LL_GPIO_WKUP_5
  *           @arg @ref LL_GPIO_WKUP_6
  *           @arg @ref LL_GPIO_WKUP_7
  * @param    Mode This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_WKUP_POLARITY_RISING
  *           @arg @ref LL_GPIO_WKUP_POLARITY_FALLING
  * @retval   None
  */
__STATIC_INLINE void LL_GPIO_SetWkupPolarity(GPIO_COMMON_Type *GPIO_Common, uint32_t Wkupx, uint32_t Mode)
{
    MODIFY_REG(GPIO_Common->PINWKEN, (Wkupx  * 0x100), (Wkupx * Mode));
}

/**
  * @brief    
  * @rmtoll   PINWKEN        LL_GPIO_GetWkupPolarity
  * @param    GPIO_Common GPIO_Common instance
  * @param    Wkupx This parameter can be one of the following values:
  *           @arg @ref LL_GPIO_WKUP_0
  *           @arg @ref LL_GPIO_WKUP_1
  *           @arg @ref LL_GPIO_WKUP_2
  *           @arg @ref LL_GPIO_WKUP_3
  *           @arg @ref LL_GPIO_WKUP_4
  *           @arg @ref LL_GPIO_WKUP_5
  *           @arg @ref LL_GPIO_WKUP_6
  *           @arg @ref LL_GPIO_WKUP_7
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_GPIO_WKUP_POLARITY_RISING
  *           @arg @ref LL_GPIO_WKUP_POLARITY_FALLING
  */
__STATIC_INLINE uint32_t LL_GPIO_GetWkupPolarity(GPIO_COMMON_Type *GPIO_Common, uint32_t Wkupx)
{
    return (uint32_t)(READ_BIT(GPIO_Common->PINWKEN, (Wkupx * 0x100)) / Wkupx);
}

/**
  * @}
  */

/** @defgroup GPIO_LL_EF_Init Initialization and de-initialization functions
  * @{
  */
ErrorStatus LL_GPIO_DeInit(GPIO_Type *GPIOx);  
void LL_GPIO_StructInit(LL_GPIO_InitTypeDef *GPIO_InitStruct);
ErrorStatus LL_GPIO_Init(GPIO_Type *GPIOx, LL_GPIO_InitTypeDef *GPIO_InitStruct);
void LL_GPIO_ALLPIN_LPM_MODE(void);

/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LC0XX_LL_GPIO_H*/

/**************************Py_Code_Generator Version: 0.1-0.5-0.1 @ 2019-09-16**************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
